пример = 'Килиманджаро' # создаем переменную и записываем в нее текст
print(пример[0]) # выводим первый символ строки из переменной пример
print(пример[-1]) # выводим последний символ строки из переменной пример, используя отрицательный индекс
print(пример[6 + 1::2]) # выводим вторую половину строки, начиная со второго символа, с нечетными индексами
print(пример[::-1]) # выводим строку в обратном порядке
print(пример[::2]) # выводим каждую вторую букву строки
print(пример[0]) # выводим первый символ строки
print(пример[-1]) # выводим последний символ строки
print(пример[-5:]) # выводим пять последних символов строки
print(пример[::-1]) # выводим строку в обратном порядке
print(пример[1::2]) # выводим символы с нечетными индексами


